# Новиков Роман
# Задание 1
# Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

a = 1
b = 2
c = 3
print(a, b, c)

name = input('Введите свое имя: ')
surname = input('Введите свою фамилию: ')
print('Вас зовут:', name, surname)